#+MACRO: ts (eval(mwp-get-ts+7  'org-mwp-classtimes-calibrate 2))
#+STARTUP: customtime

* Course Requirements:

|   | Assignment     | Due Date | Weight |       fix |
|---+----------------+----------+--------+-----------|
| # | Midterm "Exam" |          |     25 | 29.411765 |
| # | Paper Proposal |          |     25 |        25 |
| # | Final Paper    |          |     30 |        30 |
| # | Final "Exam"   |          |     25 | 27.777778 |
|---+----------------+----------+--------+-----------|
|   |                |          |    105 |      100. |
#+TBLFM: $>=$>>(100/@>$4)::@>$>>=vsum(@I..@II)

Your grade consists of the following components:

Extensions granted for medical reasons only. Late assignments will be
deducted 3% per day, with the exception of the take-home exams, which
/will be marked “0” if not handed in by 5:00 PM on the due date/. Please
note: the paper proposal is /required/, and term papers will not be
accepted if a proposal is not handed in. 

** {{{n}}} ({{{ts}}}) Science and Totalitarianism  
:PROPERTIES:
:GRADE:    1
:END:
- We'll discuss
   Mario Biagioli
   Horkneimer & Adorno
   Scott

#+begin_src emacs-lisp
(let ((mylist '(2 1)))
  (cl-loop for i from 3 to 7
           do
           (add-to-list 'mylist i ))
(nth 2 mylist))
#+end_src

#+RESULTS:
: 5

#+begin_src emacs-lisp
(mwp-get-ts+7 'mwp-classtimes-calibrate)
#+end_src

#+RESULTS:
: <2019-01-10 Thu>

#+begin_src emacs-lisp :results code
(add-hook 'mwp-show-macros-final-hook #'hack-local-variables t)
(run-hooks 'mwp-show-macros-final-hook)
;; mwp-show-macros-final-hook
mwp-classtimes-calibrate
#+end_src


#+RESULTS:
#+begin_src emacs-lisp
("<2019-01-03 Thu>" "<2019-01-01 Tue>")
#+end_src

#+begin_src emacs-lisp :results code
;;(hack-local-variables)
mwp-classtimes-calibrate
(alist-get 'mwp-classtimes-calibrate file-local-variables-alist)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
("<2019-01-03 Thu>" "<2019-01-01 Tue>")
#+end_src

#+begin_src emacs-lisp
(let ((l 
       (make-list 3 (format "<%s>" (format-time-string "%Y-%m-%d %a" )))))
  (symbol-name 'l))
#+end_src

#+RESULTS:
: l

* COMMENT Variables
#+begin_src emacs-lisp
(make-local-variable 'org-use-property-inheritance)
(setq org-use-property-inheritance nil)
(setq org-lms-baseurl "https://q.utoronto.ca/api/v1/")
(setq org-lms-token (password-store-get "q.utoronto.ca"))
;;(org-lms-set-keyword "ORG_LMS_COURSEID" 64706)

;; (org-lms-setup)
#+end_src

#+begin_src emacs-lisp
(symbol-value 'mwp-classtimes-calibrate)
#+end_src

#+RESULTS:
| <2019-01-03 Thu> | <2019-01-01 Tue> |

local variables need to be set at the end of the file.


# Local Variables:
# org-time-stamp-custom-formats: ("<%b. %d>" . "<%Y-%m-%d %H:%M>")
# org-mwp-classtimes-calibrate: ("<2019-01-03 Thu>" "<2019-01-01 Tue>" )
# End:
